app/controllers/reservations_controller.rb

  def index
    @reservations = Reservation.all
---
SELECT * FROM "reservations"

  def show
    @reservation = Reservation.find(params[:id])
---
SELECT * FROM "reservations" WHERE ("reservations"."id" = 1)

  def create
    @current_user = current_user
    @reservation = Reservation.new(params[:reservation])
    @reservation.renter = current_user
    @reservation.manager = User.find(params[:reservation][:manager_id])
    if @reservation.save
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
INSERT INTO "reservations" ("created_at", "end_at", "updated_at", "manager_id", "color", "start_at", "renter_id") VALUES('2009-10-05 20:32:31', '2009-10-05 20:42:00', '2009-10-05 20:32:31', NULL, '#ff0505', '2009-10-05 20:32:00', 1)

  def edit
    @current_user = current_user
    @reservation = Reservation.find(params[:id])
---
SELECT * FROM "reservations" WHERE ("reservations"."id" = 1)

  def update
    @current_user = current_user
    @reservation = Reservation.find(params[:id])
    if @reservation.update_attributes(params[:reservation])
      @reservation.manager = User.find(params[:reservation][:manager_id])
---
SELECT * FROM "reservations" WHERE ("reservations"."id" = 1)
UPDATE "reservations" SET "updated_at" = '2009-10-06 05:12:58', "color" = '#51a8cf', "manager_id" = 1 WHERE "id" = 1
SELECT * FROM "users" WHERE ("users"."id" = 1)