app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def edit
    @current_user = current_user
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "phone" = '435345t', "updated_at" = '2009-10-06 05:10:16', "email" = 'Libertin', "color" = '#51a8cf', "first_name" = 'Michael' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])